class Style:
    HEADER = "\033[95m"
    BLUE = "\033[94m"
    CYAN = "\033[96m"
    GREEN = "\033[92m"
    YELLOW = "\033[93m"
    RED = "\033[91m"
    BOLD = "\033[1m"
    END = "\033[0m"


def banner():
    ascii_banner = rf"""
██╗   ██╗██╗███████╗██╗ ██████╗ ███╗   ██╗██╗███╗   ██╗████████╗
██║   ██║██║██╔════╝██║██╔═══██╗████╗  ██║██║████╗  ██║╚══██╔══╝
██║   ██║██║███████╗██║██║   ██║██╔██╗ ██║██║██╔██╗ ██║   ██║
╚██╗ ██╔╝██║╚════██║██║██║   ██║██║╚██╗██║██║██║╚██╗██║   ██║
 ╚████╔╝ ██║███████║██║╚██████╔╝██║ ╚████║██║██║ ╚████║   ██║
  ╚═══╝  ╚═╝╚══════╝╚═╝ ╚═════╝ ╚═╝  ╚═══╝╚═╝╚═╝  ╚═══╝   ╚═╝

                Visual Intelligence Toolkit
    """

    print(Style.CYAN + Style.BOLD + ascii_banner + Style.END)


def print_section(title: str) -> None:
    print(f"\n{Style.YELLOW}{Style.BOLD}[ {title} ]{Style.END}")


def print_key_value(key: str, value: str) -> None:
    print(f"{Style.GREEN}{key:<20}{Style.END}: {value}")